In [1]:
from functions2 import *

In [2]:
latotale = pd.read_csv('latotale.csv', header=0)
onglet1 = pd.read_excel('~/dev/projet_ardouin/sources/sources_excel/Ardouin en 1 onglet.xls', header=0)

In [3]:
onglet1=onglet1.drop_duplicates(subset=['Intitulé / analyse\nNom lieu\nNom personne\nAffaires diverses'])
onglet1 = onglet1.rename(columns={'Intitulé / analyse\nNom lieu\nNom personne\nAffaires diverses': 'unittitle' })

In [4]:
onglet1 = onglet1[['unittitle']]

In [5]:
latotale

                        unittitle  function
0          Adrien, Veuve Timothée  Personne
1              Aigron, Demoiselle  Personne
2                    Albert, Jean  Personne
3      Aldin, Jean (alias Alding)  Personne
4               Alizeau, François  Personne
...                           ...       ...
10877  Compagnie de la mer du Sud   Affaire
10878                Croix de vie   Affaire
10879                   Invalides   Affaire
10880              Oléron, ile d’   Affaire
10881    Réjouissances publiques.   Affaire

[10882 rows x 2 columns]

In [6]:
onglet1

                      unittitle
0                      Argenton
1                        Arnoul
2            Banville, Sieur de
3      Baroire, le président de
4         Baugier, Edmé-Antoine
...                         ...
43281              Vivier Paul
43282               Vogt Martin
43283     Volage, la frégate la
43284         Weltmuller, André
43285      Zimmerman Bolloramus

[12476 rows x 1 columns]

In [7]:
onglet1.to_csv('onglet1.csv', index=False)

In [8]:
latotale = pd.read_csv('latotale.csv', header=0)
onglet1 = pd.read_csv('onglet1.csv', header=0)

In [9]:
del latotale['function']

In [10]:
diff = pd.concat([latotale,onglet1]).drop_duplicates(keep=False)

In [11]:
diff

                                unittitle
4159                 Bapaume, Peufier dit
4599                          Durand,Jean
4602                  Duranteau,la nommée
4604   Durivaud (Alias Du Rivau,Du Rivaux
4609                       Duroulet,Delle
...                                   ...
11524                 Villette, madame de
11525                    Volivert, Thomas
11526                         Volvire, de
11527                        Vouillay, de
11528                  Vozain, Olivier de

[4896 rows x 1 columns]

In [13]:
diff2 = pd.concat([onglet1,latotale]).drop_duplicates(keep=False)
diff2

                                               unittitle
13     Edits et ordonnances, Saint-Germain-en-Laye, 1...
14     Edits et ordonnances, Saint-Germain-en-Laye, 1...
15     Edits et ordonnances, Saint-Germain-en-Laye, 1...
16     Edits et ordonnances, Saint-Germain-en-Laye, 1...
17     Edits et ordonnances, Saint-Germain-en-Laye, 2...
...                                                  ...
10850                                        Latremblade
10851                                         Lupin,fort
10852                                         Madame île
10854                               Martinique,île de la
10856                                         Officiers.

[4896 rows x 1 columns]

In [12]:
diff.to_csv('diff.csv', index=False)